{"posts":[{"title":"a","text":"keke c++1int c = 1;","link":"/2023/12/01/a/"},{"title":"Abstract","text":"PurposeExplore the rationality of the supply and demand of medical resources in fever clinic in Jinshan Street in Fuzhou and then determine the next location of a clinic. DescriptionThe covid-19 virus is getting serious at present. It is obvious that the medical resource could not meet with the increasing need. Therefore, we aim to explore how to distribute medical resource to ensure the health of the population in Jinshan Street to the greatest extent possible. In our project, medical resource is reflected in fever clinics. The overall health condition is evaluated by local severe cases. Data needed Addresses of communities in Jinshan Street Population of communities in Jinshan Street Scale of fever clinics in Jinshan Street StepsPart I: Supply and Demand Evaluation Simulation of the outbreak for a period Use SEIR model Set parameters to reflect the real situation in a region Evaluate whether supply and demand meets Draw the curve of severe cases The slower rate of increase, the lower peak value, the better supply and demand meets Part II: Optimal Location of the Next Clinic Divide the map into grid Take advantage of a heat map to show the effectiveness of each cell as the fifth location","link":"/2023/01/08/abstract/"},{"title":"Methods","text":"Method Simulation of coronavirus outbreak: SEIR model (sample code + pic) The population can be divided into four compartments: Susceptible (those who can catch the disease) Exposed (those who are exposed to the disease but don’t have symptoms yet) Infected (those who show symptoms and are infective) Recovered (those who have recovered and become immune). The model takes into account following factors, which is reflected in initially set parameters. the transition rate between Susceptible and Exposed the transition rate between Infected and Recovered an incubation period, during which those who are exposed are not infective outbreak starts from an initial 10 infected cases the pattern of movement between zones within the region in a typical day The relationship between Susceptible, Exposed, Infected, Recovered is reflected in differential equations.$Susceptible \\rightarrow Exposed \\rightarrow Infected \\rightarrow Recovered$ $dS \\over dT$ eq2 eq3 eq4 Evaluate whether supply and demand meets Draw the curve of infected cases with in the region. The seriousness is defined as the peak value divided by the time of reaching the peak. pic1 Decide the location of the fifth clinic based on current simulation Use a mathematical formula to determine the effectiveness of a new location. The lower the value is, the better the location will be. $Effectiveness=\\sum_{i=0}^n w_0((x - x_0)^2 + (y - y_0)^2)$ Divide the map into grid and calculate the effectiveness for each cell Display the effectiveness in the form of heatmap, which will indicate the optimal location","link":"/2023/01/08/methods/"},{"title":"Trip to Mount Wuyi","text":"Our trip to Mount WuyiThis is our trip to Mount Wuyi (513). We picked up a Xunlongchi(寻龙尺) on the way.","link":"/2023/01/07/trip/"},{"title":"Discussion","text":"Discussion Simulation: Due to a lack of data, many assumptions are made, which may not be consistent with the real situation here. This will cause errors. However, those missing information can be acquired somehow for better simulation. Assumptions: The pattern of movement between zones within the region in a typical day is randomized Solution: the exchange of population between zones can be obtained by phone data like public transportation usage The transition rate between Infected and Recovered is the same for all regions Solution: count the average recovering time for each region, which is related to population structure and clinics scale, etc. Evaluate Supply and Demand relation Currently, we use the formula peak value for infected cases divided by the time to peak to reflect the seriousness of outbreak in a region. However, we should also take into account factors such as the proportion of severe disease and the extent of economic damage. For example, communities with a large proportion of elderly people should be given priority. Select the location for the fifth clinic We design the effectiveness of a new location as a formula. $cost=\\sum_{i=0}^n w_0((x - x_0)^2 + (y - y_0)^2)$ $w_0$ reflects the seriousness of the outbreak in the community. For the convenience, the clinic should be built nearer to area with serious situation. We aim to minimize the cost value in order to select the optimal location. There is still some room for improvement. We divide the Jinshan Street into $n=21$ communities, and treat them as a point with correspoinding population for the sake of convenience. However, a community consists of many residential quarters, and each residential quarter has many buildings. This method can be optimized given real population data of Jinshan Street. In this way, we could treat people in the same building as a whole and build more complex but accurate models The distance between the new clinic and communities are all straight-line distance. However, we should consider public transport development and road condition. For future research, we may take advantage of map software to calculate the real distance.","link":"/2023/01/08/discussion/"},{"title":"Special topic for EECS 376","text":"Distinct CountBackgroundSay, $\\{a_1, \\cdots a_M\\}$ are a set of IPs. They are sent to a router, and now the router wants to figure out how many distinct IPs. Let $n$ be the number of distinct IPs. If using a hashmap, it may take $O(n)$ space to implement. We can allow $n$ within a range: Pr[\\hat{n} \\in \\{ (1-\\epsilon)n, (1+\\epsilon)n \\}] < \\deltaCall it the “$(\\epsilon, \\delta)$” guarantee. We are aiming for a space of $O(\\epsilon^{-2} \\log{\\frac{1}{\\delta}})$. Aim Find an unbiased estimator (Random Hash Function). Reduce the variance (Apply Chebychev). Reduce the error probability (Apply Chernoff-Hoeffding). In general, a Random Hash Function is like: $h(IP address) \\rightarrow [0, 1]$. $h(a)$ is uniformly in the interval of [0, 1] and is independent. Min Sketch MethodWe are using the “Min sketch”: $Y = min(h(a_1), \\cdots, h(a_M))$. The reason is that $Y$ is good as it filters out duplicates of $a_i$. The distribution of $Y$ is only affected by the number of distinct elements in $\\{a_1, \\cdots a_M\\}$. Intuitive GuessThis process is equivalent to getting the smallest among $n$ random values between $[0, 1]$.Intuitively, this result is $\\frac{1}{n+1}$, because we can take $n = 1$ and the result is $\\frac{1}{2}$. Mathematical ProofE(Y) = \\int_{0}^{1} Pr(Y\\geq x) \\, dx = \\int_{0}^{1} Pr(Y\\geq x) \\, dx= \\int_{0}^{1} (1-x)^n \\, dxTherefore the expectation of $Y$, E(Y) = \\int_{0}^{1} x^n \\, dx = \\frac{1}{n+1}The estimation of $\\hat{n}$: $\\hat{n} = \\frac{1}{Y} - 1$. But this expected value of $\\hat{n}$ is infinite as $E\\left[\\frac{1}{Y}\\right] \\rightarrow \\infty$. To prove this, we make a partition between $[0, 1]$ | $\\cdots$ | $\\frac{1}{8}$ | $\\frac{1}{4}$ | $\\frac{1}{2}$ | In reality, E\\left[\\frac{1}{Y}\\right] \\geq \\frac{1}{2}\\times 1 + \\frac{1}{4}\\times 2 + \\frac{1}{8} \\times 4 + \\cdotsMultiple Hash FunctionsWe use $k$ hash functions and take its mean to approximate this $Y$, i.e., $Z = \\frac{Y_1 + Y_2 + \\cdots Y_k}{k}$. The expectation of $Z$ is equal to that of $Y$, i.e, $E(Z) = \\frac{1}{n+1}$, and its variance is reduced. Variance of $Z$Remember that, Var(Y) = E(Y^2) - E(Y)^2Var(X+Y) = Var(X) + Var(Y)Var(c) = c^2 Var(X)Therefore the variance of $Z$, Var(Z) = \\frac{1}{k^2} \\sum Var(Y_i) = \\frac{1}{k} Var(Y_i)Then we calculate the variance of $Y_i$, denote as $Y$. E(Y^2) = \\int_{0}^{1} Pr(Y^2\\geq x) \\, dx = \\int_{0}^{1} Pr(Y\\geq \\sqrt{x}) \\, dx= \\int_{0}^{1} (1-\\sqrt{x})^n \\, dxLet $u = 1 - \\sqrt{x}$, then $x = (1-u)^2$, $dx = -2(1-u) du$. E(Y^2) = \\int_{1}^{0} -2(1-u)u^n \\, du = 2\\int_{0}^{1} (1-u)u^n \\, du = \\frac{2}{(n+1)(n+2)}Var(Y) = E(Y^2) - E(Y)^2 = \\frac{2}{(n+1)(n+2)} - \\frac{1}{(n+1)^2} \\leq \\frac{1}{(n+1)^2}Therefore we get the variance of $Z$, Var(Z) = \\frac{Var(Y)}{k} \\leq \\frac{1}{k(n+1)^2}Chebychev InequalityUsing Chebychev, Pr(|Z - \\frac{1}{n+1}| \\geq \\frac{\\epsilon}{n+1}) \\leq \\frac{Var(Z)}{(\\frac{\\epsilon}{n+1})^2} \\leq \\frac{1}{k\\epsilon^2}Picking $\\frac{1}{k\\epsilon^2} \\leq \\frac{1}{3}$ (Randomly, just a small value), then $k = \\frac{3}{\\epsilon^2}$. $Pr(\\frac{1}{Z} - 1\\textit{ is a good estimate}) \\geq \\frac{2}{3}$. We can pick $k$ larger, but it is not practical, because we are paying for the accuracy, $k = \\frac{\\delta}{\\epsilon^2}$. ImprovementsWe take multiple $Z$ and get their median: W = median(Z_1, \\cdots Z_k) median is more robust than simply $Z$ As long as good estimates is more than half, we are happy with that result. Define $I_i = 1$ when $\\frac{1}{Z} - 1$ is a good estimator. $E[I_i] \\geq \\frac{2}{3}$, $X = I_1 + \\cdots + I_l$, then $E(X) \\geq \\frac{2l}{3}$. $Pr(X \\leq \\frac{l}{2}) = Pr(\\frac{X}{l} \\leq \\frac{2}{3} - \\frac{1}{6}) \\leq e^{-2 \\frac{1}{6^2} l}$ This is a logarithmic approximation. The Space (in bits): $3 \\epsilon^{-2} \\log{\\ln{\\frac{1}{3}}} \\cdot 64$bits.","link":"/2023/12/04/Special%20Topic/"}],"tags":[{"name":"tag1","slug":"tag1","link":"/tags/tag1/"},{"name":"tag2","slug":"tag2","link":"/tags/tag2/"},{"name":"Problems","slug":"Problems","link":"/tags/Problems/"},{"name":"Methods","slug":"Methods","link":"/tags/Methods/"},{"name":"[object Object]","slug":"object-Object","link":"/tags/object-Object/"},{"name":"result","slug":"result","link":"/tags/result/"},{"name":"Trip","slug":"Trip","link":"/tags/Trip/"},{"name":"Entertaining","slug":"Entertaining","link":"/tags/Entertaining/"},{"name":"discussion","slug":"discussion","link":"/tags/discussion/"},{"name":"Course Material","slug":"Course-Material","link":"/tags/Course-Material/"},{"name":"DWP","slug":"DWP","link":"/tags/DWP/"}],"categories":[{"name":"Cat1","slug":"Cat1","link":"/categories/Cat1/"},{"name":"Problems","slug":"Problems","link":"/categories/Problems/"},{"name":"result","slug":"result","link":"/categories/result/"},{"name":"Entertainment","slug":"Entertainment","link":"/categories/Entertainment/"},{"name":"discussion","slug":"discussion","link":"/categories/discussion/"},{"name":"Story","slug":"Entertainment/Story","link":"/categories/Entertainment/Story/"},{"name":"DWP","slug":"DWP","link":"/categories/DWP/"},{"name":"Course Material","slug":"Course-Material","link":"/categories/Course-Material/"}],"pages":[]}